In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

In [2]:
%%sql 
DROP TABLE IF EXISTS students;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

### 1. Create a table called students with the following columns:
- student_id (integer, primary key)
- name (text, not null)
- age (integer)
- major (text)

In [3]:
%%sql

CREATE TABLE students(
    student_id INT PRIMARY KEY,
    name VARCHAR(10) NOT NULL,
    age INT,
    major VARCHAR(30)
);

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

### 2. Insert one student into the students table and check it
student_id = 1, name = 'Alice', age = 20, major = 'Computer Science'

In [4]:
%%sql
INSERT INTO students (student_id, name, age, major)
VALUES (2, 'Alice', 20, 'Computer Science');

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[]

In [5]:
%%sql
SELECT *
FROM students

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[(2, 'Alice', 20, 'Computer Science')]

### 3. Insert three more students in a single statement and check it
- Bob, age 22, Mathematics
- Charlie, age 19, Physics
- Diana, age 21, Computer Science

In [6]:
%%sql
INSERT INTO students (student_id, name, age, major)
VALUES 
    (3, 'Bob', 22, 'Mathematics'),
    (4, 'Charlie', 19, 'Physics'),
    (5, 'Diana', 21, 'Computer Science');

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[]

In [7]:
%%sql
SELECT * 
FROM students;

 * postgresql://user:***@localhost:5432/postgres
4 rows affected.

[(2, 'Alice', 20, 'Computer Science'),
 (3, 'Bob', 22, 'Mathematics'),
 (4, 'Charlie', 19, 'Physics'),
 (5, 'Diana', 21, 'Computer Science')]

### 4. Insert a student with no major declared yet:
- Eve, age 18

In [8]:
%%sql
INSERT INTO students(student_id, name, age, major)
VALUES (6, 'Eve', 18, NULL);

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[]

In [9]:
%%sql 
SELECT *
FROM students

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(2, 'Alice', 20, 'Computer Science'),
 (3, 'Bob', 22, 'Mathematics'),
 (4, 'Charlie', 19, 'Physics'),
 (5, 'Diana', 21, 'Computer Science'),
 (6, 'Eve', 18, None)]

### 5. Update Charlieâ€™s major to 'Chemistry'

In [10]:
%%sql
UPDATE students
SET major = 'Chemistry'
WHERE name = 'Charlie';

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[]

### What happened to the row?

In [11]:
%%sql
SELECT * 
FROM students

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(2, 'Alice', 20, 'Computer Science'),
 (3, 'Bob', 22, 'Mathematics'),
 (5, 'Diana', 21, 'Computer Science'),
 (6, 'Eve', 18, None),
 (4, 'Charlie', 19, 'Chemistry')]

It went to the end of the table

### 6. Increase the age of all students who are in Computer Science by 1 year.

In [12]:
%%sql
UPDATE students
SET age = age + 1
WHERE major = 'Computer Science';

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[]

In [13]:
%%sql
SELECT *  
FROM students

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(3, 'Bob', 22, 'Mathematics'),
 (6, 'Eve', 18, None),
 (4, 'Charlie', 19, 'Chemistry'),
 (2, 'Alice', 21, 'Computer Science'),
 (5, 'Diana', 22, 'Computer Science')]

### 7. Delete the record for Bob

In [14]:
%%sql
DELETE FROM students
WHERE name = 'Bob';

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[]

In [15]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
4 rows affected.

[(6, 'Eve', 18, None),
 (4, 'Charlie', 19, 'Chemistry'),
 (2, 'Alice', 21, 'Computer Science'),
 (5, 'Diana', 22, 'Computer Science')]

### 8. Delete all students who are younger than 20.

In [16]:
%%sql
DELETE FROM students
WHERE age < 20;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[]

In [17]:
%%sql
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[(2, 'Alice', 21, 'Computer Science'), (5, 'Diana', 22, 'Computer Science')]

### 9. Re-insert Bob (student_id = 6, age 28) into the table, but this time set his major to 'Economics'.

In [18]:
%%sql 
INSERT INTO students(student_id, name, age, major)
VALUES(3, 'Bob', 20, 'Economics');

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[]

In [19]:
%%sql 
SELECT * FROM students

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[(2, 'Alice', 21, 'Computer Science'),
 (5, 'Diana', 22, 'Computer Science'),
 (3, 'Bob', 20, 'Economics')]

### 10. Remove the table completely by dropping it.

In [20]:
%%sql
DROP TABLE students;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [21]:
%%sql
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
(psycopg2.errors.UndefinedTable) relation "students" does not exist
LINE 1: SELECT * FROM students;
                      ^

[SQL: SELECT * FROM students;]
(Background on this error at: https://sqlalche.me/e/20/f405)